; domain
(define (domain satellite)
  (:requirements :strips :typing)
  (:types satellite direction instrument mode)
  (:predicates 
	(on_board ?i - instrument ?s - satellite)
	(supports ?i - instrument ?m - mode)
	(pointing ?s - satellite ?d - direction)
	(power_avail ?s - satellite)
	(power_on ?i - instrument)
	(calibrated ?i - instrument)
	(have_image ?d - direction ?m - mode)
	(calibration_target ?i - instrument ?d - direction))
 
  (:action turn_to
   :parameters (?s - satellite ?d_new - direction ?d_prev - direction)
   :precondition (and (pointing ?s ?d_prev))
   :effect (and  (pointing ?s ?d_new)
                 (not (pointing ?s ?d_prev))))
 
  (:action switch_on
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s) 
                      (power_avail ?s))
   :effect (and (power_on ?i)
                (not (calibrated ?i))
                (not (power_avail ?s))))

  (:action switch_off
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s)
                      (power_on ?i))
   :effect (and (not (power_on ?i))
                (power_avail ?s)))

  (:action calibrate
   :parameters (?s - satellite ?i - instrument ?d - direction)
   :precondition (and (on_board ?i ?s)
		      (calibration_target ?i ?d)
                      (pointing ?s ?d)
                      (power_on ?i))
   :effect (calibrated ?i))

  (:action take_image
   :parameters (?s - satellite ?d - direction ?i - instrument ?m - mode)
   :precondition (and (calibrated ?i)
                      (on_board ?i ?s)
                      (supports ?i ?m)
                      (power_on ?i)
                      (pointing ?s ?d))
   :effect (have_image ?d ?m)))

; problem
; params: satgen 518889 1 1 4 4 6
(define (problem strips-sat-x-1)
(:domain satellite)
(:objects
	satellite0 - satellite
	instrument0 - instrument
	infrared3 - mode
	spectrograph2 - mode
	image0 - mode
	thermograph1 - mode
	GroundStation0 - direction
	GroundStation1 - direction
	Star3 - direction
	GroundStation2 - direction
	Planet4 - direction
	Phenomenon5 - direction
	Star6 - direction
	Star7 - direction
	Star8 - direction
	Phenomenon9 - direction
)
(:init
	(supports instrument0 spectrograph2)
	(supports instrument0 image0)
	(supports instrument0 thermograph1)
	(supports instrument0 infrared3)
	(calibration_target instrument0 GroundStation2)
	(on_board instrument0 satellite0)
	(power_avail satellite0)
	(pointing satellite0 GroundStation0)
)
(:goal (and
	(pointing satellite0 GroundStation1)
	(have_image Planet4 infrared3)
	(have_image Phenomenon5 image0)
	(have_image Star6 infrared3)
	(have_image Star7 spectrograph2)
	(have_image Star8 image0)
	(have_image Phenomenon9 thermograph1)
))

)

; plan
1. (switch_on instrument0 satellite0)
   deleted: (power_avail satellite0)
   added: (power_on instrument0)
   goals met: 0 of 7
2. (turn_to satellite0 star8 groundstation0)
   deleted: (pointing satellite0 groundstation0)
   added: (pointing satellite0 star8)
   goals met: 0 of 7
3. (turn_to satellite0 groundstation2 star8)
   deleted: (pointing satellite0 star8)
   added: (pointing satellite0 groundstation2)
   goals met: 0 of 7
4. (calibrate satellite0 instrument0 groundstation2)
   added: (calibrated instrument0)
   goals met: 0 of 7
5. (turn_to satellite0 star8 groundstation2)
   deleted: (pointing satellite0 groundstation2)
   added: (pointing satellite0 star8)
   goals met: 0 of 7
6. (take_image satellite0 star8 instrument0 image0)
   added: (have_image star8 image0)
   goals met: 1 of 7
7. (turn_to satellite0 star7 star8)
   deleted: (pointing satellite0 star8)
   added: (pointing satellite0 star7)
   goals met: 1 of 7
8. (take_image satellite0 star7 instrument0 spectrograph2)
   added: (have_image star7 spectrograph2)
   goals met: 2 of 7
9. (turn_to satellite0 star6 star7)
   deleted: (pointing satellite0 star7)
   added: (pointing satellite0 star6)
   goals met: 2 of 7
10. (take_image satellite0 star6 instrument0 infrared3)
   added: (have_image star6 infrared3)
   goals met: 3 of 7
11. (turn_to satellite0 planet4 star6)
   deleted: (pointing satellite0 star6)
   added: (pointing satellite0 planet4)
   goals met: 3 of 7
12. (take_image satellite0 planet4 instrument0 infrared3)
   added: (have_image planet4 infrared3)
   goals met: 4 of 7
13. (turn_to satellite0 phenomenon9 planet4)
   deleted: (pointing satellite0 planet4)
   added: (pointing satellite0 phenomenon9)
   goals met: 4 of 7
14. (take_image satellite0 phenomenon9 instrument0 thermograph1)
   added: (have_image phenomenon9 thermograph1)
   goals met: 5 of 7
15. (turn_to satellite0 phenomenon5 phenomenon9)
   deleted: (pointing satellite0 phenomenon9)
   added: (pointing satellite0 phenomenon5)
   goals met: 5 of 7
16. (take_image satellite0 phenomenon5 instrument0 image0)
   added: (have_image phenomenon5 image0)
   goals met: 6 of 7
17. (turn_to satellite0 groundstation1 phenomenon5)
   deleted: (pointing satellite0 phenomenon5)
   added: (pointing satellite0 groundstation1)
   goals met: 7 of 7
